Revit 2015 API
Category Methods
The Category type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetGraphicsStyle
Gets the graphics style associated with this category for the given graphics style type.
GetHashCode |  (Overrides Object.GetHashCode().)
GetLineWeight
Retrieves the line weight assigned to the category for the given graphics style type.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetLineWeight
Sets the line weight for the given graphics style type.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Category Class
Autodesk.Revit.DB Namespace